tests/krungthai-next/jmeter.log
2020-01-30 06:50:21,966 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2020-01-30 06:50:22,024 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.1.1/bin/user.properties
2020-01-30 06:50:22,026 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.1.1/bin/system.properties
2020-01-30 06:50:22,027 INFO o.a.j.JMeter: Setting System property: log_level.jmeter=DEBUG
2020-01-30 06:50:22,028 INFO o.a.j.JMeter: Setting JMeter property: TARGET_HOST=www.map5.nl
2020-01-30 06:50:22,029 INFO o.a.j.JMeter: Setting JMeter property: TARGET_PORT=80
2020-01-30 06:50:22,029 INFO o.a.j.JMeter: Setting JMeter property: TARGET_PATH=/kaarten.html
2020-01-30 06:50:22,032 INFO o.a.j.JMeter: Setting JMeter property: TARGET_KEYWORD=Kaartdiensten
2020-01-30 06:50:22,043 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2020-01-30 06:50:22,044 INFO o.a.j.JMeter: Version 5.1.1 r1855137
2020-01-30 06:50:22,044 INFO o.a.j.JMeter: java.version=1.8.0_242
2020-01-30 06:50:22,045 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2020-01-30 06:50:22,046 INFO o.a.j.JMeter: os.name=Linux
2020-01-30 06:50:22,046 INFO o.a.j.JMeter: os.arch=amd64
2020-01-30 06:50:22,047 INFO o.a.j.JMeter: os.version=4.19.76-linuxkit
2020-01-30 06:50:22,047 INFO o.a.j.JMeter: file.encoding=UTF-8
2020-01-30 06:50:22,048 INFO o.a.j.JMeter: java.awt.headless=true
2020-01-30 06:50:22,049 INFO o.a.j.JMeter: Max memory     =234881024
2020-01-30 06:50:22,049 INFO o.a.j.JMeter: Available Processors =4
2020-01-30 06:50:22,058 INFO o.a.j.JMeter: Default Locale=English (EN)
2020-01-30 06:50:22,059 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2020-01-30 06:50:22,060 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.1.1
2020-01-30 06:50:22,061 INFO o.a.j.JMeter: user.dir  =/Users/ktb_user/Documents/loadtest/docker-jmeter
2020-01-30 06:50:22,062 INFO o.a.j.JMeter: PWD       =/Users/ktb_user/Documents/loadtest/docker-jmeter
2020-01-30 06:50:22,063 INFO o.a.j.JMeter: IP: 172.17.0.2 Name: bc22722e71c2 FullName: bc22722e71c2
2020-01-30 06:50:22,073 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/Users/ktb_user/Documents/loadtest/docker-jmeter/tests/krungthai-next/report'
2020-01-30 06:50:22,081 INFO o.a.j.s.FileServer: Default base='/Users/ktb_user/Documents/loadtest/docker-jmeter'
2020-01-30 06:50:22,097 INFO o.a.j.s.FileServer: Set new base='/Users/ktb_user/Documents/loadtest/docker-jmeter/tests/krungthai-next'
2020-01-30 06:50:22,507 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2020-01-30 06:50:22,555 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2020-01-30 06:50:22,567 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2020-01-30 06:50:22,586 INFO o.a.j.s.SaveService: Loading file: tests/krungthai-next/Transfer_Intranal_KTB_to_KTB.jmx
2020-01-30 06:50:22,671 INFO o.a.j.p.h.c.CacheManager: Will only cache the following methods: [GET]
2020-01-30 06:50:22,678 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2020-01-30 06:50:22,735 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-01-30 06:50:22,736 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-01-30 06:50:22,736 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-01-30 06:50:22,737 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-01-30 06:50:22,737 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2020-01-30 06:50:22,738 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2020-01-30 06:50:22,924 INFO o.a.j.JMeter: Creating summariser <summary>
2020-01-30 06:50:22,955 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2020-01-30 06:50:22,957 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: tests/krungthai-next/test-plan.jtl
2020-01-30 06:50:22,958 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /opt/apache-jmeter-5.1.1/bin/reportgenerator.properties
2020-01-30 06:50:22,959 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2020-01-30 06:50:22,969 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2020-01-30 06:50:22,979 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2020-01-30 06:50:22,981 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction : {} is empty, not APDEX per transaction customization
2020-01-30 06:50:22,982 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2020-01-30 06:50:22,983 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2020-01-30 06:50:22,984 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2020-01-30 06:50:22,984 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2020-01-30 06:50:22,985 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2020-01-30 06:50:22,986 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2020-01-30 06:50:22,996 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 06:50:22,997 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 06:50:22,998 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 06:50:22,999 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 06:50:22,999 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 06:50:23,000 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 06:50:23,001 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 06:50:23,002 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 06:50:23,003 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 06:50:23,003 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 06:50:23,006 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2020-01-30 06:50:23,007 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2020-01-30 06:50:23,007 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2020-01-30 06:50:23,009 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2020-01-30 06:50:23,011 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2020-01-30 06:50:23,012 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2020-01-30 06:50:23,024 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2020-01-30 06:50:23,027 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-01-30 06:50:23,028 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-01-30 06:50:23,045 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2020-01-30 06:50:23,046 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2020-01-30 06:50:23,776 WARN o.a.j.e.u.FunctionParser: Probably an invalid function string: rampUpPeriod
2020-01-30 06:50:23,854 INFO c.b.c.RandomCSVReader: Start reading the file: /Users/ktb_user/Documents/loadtest/docker-jmeter/tests/krungthai-next/./test_data.csv
2020-01-30 06:50:23,904 INFO c.b.c.RandomCSVReader: Reading finished. Found 11 records in your csv file
2020-01-30 06:50:23,985 INFO o.a.j.JMeter: Running test (1580367023985)
2020-01-30 06:50:24,058 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 01 Transfer intra
2020-01-30 06:50:24,059 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group 01 Transfer intra.
2020-01-30 06:50:24,059 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2020-01-30 06:50:24,060 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=0 delayedStart=false
2020-01-30 06:50:24,093 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2020-01-30 06:50:24,093 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2020-01-30 06:50:24,097 INFO o.a.j.t.JMeterThread: Thread started: 01 Transfer intra 1-1
2020-01-30 06:50:24,555 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2020-01-30 06:50:24,556 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2020-01-30 06:50:24,557 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2020-01-30 06:50:24,557 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2020-01-30 06:50:25,271 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = bc22722e71c2
2020-01-30 06:50:25,287 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2020-01-30 06:50:31,650 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2020-01-30 06:50:31,651 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2020-01-30 06:50:32,000 INFO o.a.j.r.Summariser: summary +      6 in 00:00:08 =    0.7/s Avg:   239 Min:     1 Max:   620 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-01-30 06:51:00,537 INFO o.a.j.r.Summariser: summary +     29 in 00:00:29 =    1.0/s Avg:   184 Min:     0 Max:   427 Err:     9 (31.03%) Active: 1 Started: 1 Finished: 0
2020-01-30 06:51:00,540 INFO o.a.j.r.Summariser: summary =     35 in 00:00:37 =    1.0/s Avg:   193 Min:     0 Max:   620 Err:     9 (25.71%)
2020-01-30 06:51:04,975 INFO o.a.j.t.JMeterThread: Thread is done: 01 Transfer intra 1-1
2020-01-30 06:51:04,975 INFO o.a.j.t.JMeterThread: Thread finished: 01 Transfer intra 1-1
2020-01-30 06:51:04,978 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2020-01-30 06:51:04,980 INFO o.a.j.r.Summariser: summary +      5 in 00:00:04 =    1.1/s Avg:   163 Min:     0 Max:   337 Err:     1 (20.00%) Active: 0 Started: 1 Finished: 1
2020-01-30 06:51:04,981 INFO o.a.j.r.Summariser: summary =     40 in 00:00:41 =    1.0/s Avg:   189 Min:     0 Max:   620 Err:    10 (25.00%)
2020-01-30 06:51:04,981 INFO o.a.j.JMeter: Generating Dashboard
2020-01-30 06:51:04,982 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2020-01-30 06:51:05,030 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2020-01-30 06:51:05,224 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2020-01-30 06:51:05,225 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2020-01-30 06:51:05,230 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2020-01-30 06:51:05,231 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2020-01-30 06:51:05,240 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2020-01-30 06:51:05,255 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2020-01-30 06:51:05,256 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2020-01-30 06:51:05,257 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2020-01-30 06:51:05,295 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2020-01-30 06:51:05,296 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2020-01-30 06:51:05,298 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2020-01-30 06:51:05,298 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2020-01-30 06:51:05,311 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2020-01-30 06:51:05,312 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 280 samples
2020-01-30 06:51:05,313 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2020-01-30 06:51:05,313 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2020-01-30 06:51:05,314 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2020-01-30 06:51:05,315 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2020-01-30 06:51:05,316 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2020-01-30 06:51:05,316 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2020-01-30 06:51:05,334 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2020-01-30 06:51:05,346 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2020-01-30 06:51:05,348 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2020-01-30 06:51:05,351 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2020-01-30 06:51:05,352 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 600 samples
2020-01-30 06:51:05,353 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 120 samples
2020-01-30 06:51:05,353 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 40 samples
2020-01-30 06:51:05,355 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 40 samples produced in 252ms on channel 0
2020-01-30 06:51:05,355 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2020-01-30 06:51:05,361 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2020-01-30 06:51:05,361 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2020-01-30 06:51:05,363 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2020-01-30 06:51:05,364 INFO o.a.j.r.d.JsonExporter: Checking output folder
2020-01-30 06:51:05,369 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to /Users/ktb_user/Documents/loadtest/docker-jmeter/tests/krungthai-next/report/statistics.json
2020-01-30 06:51:05,779 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2020-01-30 06:51:05,791 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /Users/ktb_user/Documents/loadtest/docker-jmeter/tests/krungthai-next/report
2020-01-30 06:51:05,965 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /Users/ktb_user/Documents/loadtest/docker-jmeter/tests/krungthai-next/report, creating folder structure
2020-01-30 06:51:05,985 INFO o.a.j.r.d.TemplateVisitor: Copying folder from '/opt/apache-jmeter-5.1.1/bin/report-template' to '/Users/ktb_user/Documents/loadtest/docker-jmeter/tests/krungthai-next/report', got message:[/Users/ktb_user/Documents/loadtest/docker-jmeter/tests/krungthai-next/report/statistics.json], found non empty folder with following content {}, will be ignored
2020-01-30 06:51:07,143 INFO o.a.j.JMeter: Dashboard generated