tests/krungthai-next/jmeter.log
2020-01-30 07:35:10,155 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2020-01-30 07:35:10,205 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.1.1/bin/user.properties
2020-01-30 07:35:10,207 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.1.1/bin/system.properties
2020-01-30 07:35:10,208 INFO o.a.j.JMeter: Setting System property: log_level.jmeter=DEBUG
2020-01-30 07:35:10,220 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2020-01-30 07:35:10,221 INFO o.a.j.JMeter: Version 5.1.1 r1855137
2020-01-30 07:35:10,221 INFO o.a.j.JMeter: java.version=1.8.0_242
2020-01-30 07:35:10,222 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2020-01-30 07:35:10,222 INFO o.a.j.JMeter: os.name=Linux
2020-01-30 07:35:10,223 INFO o.a.j.JMeter: os.arch=amd64
2020-01-30 07:35:10,224 INFO o.a.j.JMeter: os.version=4.19.76-linuxkit
2020-01-30 07:35:10,224 INFO o.a.j.JMeter: file.encoding=UTF-8
2020-01-30 07:35:10,225 INFO o.a.j.JMeter: java.awt.headless=true
2020-01-30 07:35:10,225 INFO o.a.j.JMeter: Max memory     =226492416
2020-01-30 07:35:10,226 INFO o.a.j.JMeter: Available Processors =4
2020-01-30 07:35:10,234 INFO o.a.j.JMeter: Default Locale=English (EN)
2020-01-30 07:35:10,236 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2020-01-30 07:35:10,237 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.1.1
2020-01-30 07:35:10,238 INFO o.a.j.JMeter: user.dir  =/Users/ktb_user/Documents/loadtest/loadtest
2020-01-30 07:35:10,240 INFO o.a.j.JMeter: PWD       =/Users/ktb_user/Documents/loadtest/loadtest
2020-01-30 07:35:10,241 INFO o.a.j.JMeter: IP: 172.17.0.2 Name: 854dd1e09c4c FullName: 854dd1e09c4c
2020-01-30 07:35:10,250 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/Users/ktb_user/Documents/loadtest/loadtest/tests/krungthai-next/report'
2020-01-30 07:35:10,258 INFO o.a.j.s.FileServer: Default base='/Users/ktb_user/Documents/loadtest/loadtest'
2020-01-30 07:35:10,275 INFO o.a.j.s.FileServer: Set new base='/Users/ktb_user/Documents/loadtest/loadtest/tests/krungthai-next'
2020-01-30 07:35:10,675 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2020-01-30 07:35:10,716 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2020-01-30 07:35:10,728 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2020-01-30 07:35:10,746 INFO o.a.j.s.SaveService: Loading file: tests/krungthai-next/Transfer_Intranal_KTB_to_KTB.jmx
2020-01-30 07:35:10,833 INFO o.a.j.p.h.c.CacheManager: Will only cache the following methods: [GET]
2020-01-30 07:35:10,839 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2020-01-30 07:35:10,902 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-01-30 07:35:10,903 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-01-30 07:35:10,903 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-01-30 07:35:10,904 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-01-30 07:35:10,904 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2020-01-30 07:35:10,905 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2020-01-30 07:35:11,093 INFO o.a.j.JMeter: Creating summariser <summary>
2020-01-30 07:35:11,118 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2020-01-30 07:35:11,122 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: tests/krungthai-next/Transfer_Intranal_KTB_to_KTB.jtl
2020-01-30 07:35:11,125 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /opt/apache-jmeter-5.1.1/bin/reportgenerator.properties
2020-01-30 07:35:11,127 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2020-01-30 07:35:11,138 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2020-01-30 07:35:11,146 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2020-01-30 07:35:11,147 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction : {} is empty, not APDEX per transaction customization
2020-01-30 07:35:11,148 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2020-01-30 07:35:11,148 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2020-01-30 07:35:11,149 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2020-01-30 07:35:11,150 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2020-01-30 07:35:11,150 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2020-01-30 07:35:11,152 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2020-01-30 07:35:11,161 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 07:35:11,165 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 07:35:11,166 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 07:35:11,166 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 07:35:11,167 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 07:35:11,168 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 07:35:11,168 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 07:35:11,169 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 07:35:11,170 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 07:35:11,171 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-30 07:35:11,175 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2020-01-30 07:35:11,175 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2020-01-30 07:35:11,176 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2020-01-30 07:35:11,177 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2020-01-30 07:35:11,178 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2020-01-30 07:35:11,178 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2020-01-30 07:35:11,190 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2020-01-30 07:35:11,193 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-01-30 07:35:11,193 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-01-30 07:35:11,211 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2020-01-30 07:35:11,212 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2020-01-30 07:35:11,978 WARN o.a.j.e.u.FunctionParser: Probably an invalid function string: rampUpPeriod
2020-01-30 07:35:12,063 INFO c.b.c.RandomCSVReader: Start reading the file: /Users/ktb_user/Documents/loadtest/loadtest/tests/krungthai-next/test_data.csv
2020-01-30 07:35:12,121 INFO c.b.c.RandomCSVReader: Reading finished. Found 11 records in your csv file
2020-01-30 07:35:12,198 INFO o.a.j.JMeter: Running test (1580369712197)
2020-01-30 07:35:12,248 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 01 Transfer intra
2020-01-30 07:35:12,249 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group 01 Transfer intra.
2020-01-30 07:35:12,250 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2020-01-30 07:35:12,251 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=0 delayedStart=false
2020-01-30 07:35:12,290 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2020-01-30 07:35:12,290 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2020-01-30 07:35:12,298 INFO o.a.j.t.JMeterThread: Thread started: 01 Transfer intra 1-1
2020-01-30 07:35:13,778 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2020-01-30 07:35:13,779 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2020-01-30 07:35:13,780 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2020-01-30 07:35:13,781 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2020-01-30 07:35:13,956 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = 854dd1e09c4c
2020-01-30 07:35:13,975 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2020-01-30 07:35:20,335 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2020-01-30 07:35:20,336 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2020-01-30 07:35:31,101 INFO o.a.j.r.Summariser: summary +     15 in 00:00:19 =    0.8/s Avg:   249 Min:     0 Max:   610 Err:     3 (20.00%) Active: 1 Started: 1 Finished: 0
2020-01-30 07:36:00,741 INFO o.a.j.r.Summariser: summary +     24 in 00:00:30 =    0.8/s Avg:   322 Min:     0 Max:  1144 Err:     3 (12.50%) Active: 1 Started: 1 Finished: 0
2020-01-30 07:36:00,748 INFO o.a.j.r.Summariser: summary =     39 in 00:00:49 =    0.8/s Avg:   294 Min:     0 Max:  1144 Err:     6 (15.38%)
2020-01-30 07:36:01,025 INFO o.a.j.t.JMeterThread: Thread is done: 01 Transfer intra 1-1
2020-01-30 07:36:01,026 INFO o.a.j.t.JMeterThread: Thread finished: 01 Transfer intra 1-1
2020-01-30 07:36:01,031 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2020-01-30 07:36:01,034 INFO o.a.j.r.Summariser: summary +      1 in 00:00:00 =    3.4/s Avg:   187 Min:   187 Max:   187 Err:     0 (0.00%) Active: 0 Started: 1 Finished: 1
2020-01-30 07:36:01,035 INFO o.a.j.r.Summariser: summary =     40 in 00:00:49 =    0.8/s Avg:   291 Min:     0 Max:  1144 Err:     6 (15.00%)
2020-01-30 07:36:01,036 INFO o.a.j.JMeter: Generating Dashboard
2020-01-30 07:36:01,037 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2020-01-30 07:36:01,081 WARN o.a.j.s.CSVSaveService: Unknown column name 1580369713783
2020-01-30 07:36:01,090 WARN o.a.j.r.c.CsvSampleReader: File '/Users/ktb_user/Documents/loadtest/loadtest/tests/krungthai-next/Transfer_Intranal_KTB_to_KTB.jtl' does not contain the field names header, ensure the jmeter.save.saveservice.* properties are the same as when the CSV file was created or the file may be read incorrectly when generating report
2020-01-30 07:36:01,101 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2020-01-30 07:36:01,326 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2020-01-30 07:36:01,327 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2020-01-30 07:36:01,346 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2020-01-30 07:36:01,347 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2020-01-30 07:36:01,357 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2020-01-30 07:36:01,373 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2020-01-30 07:36:01,373 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2020-01-30 07:36:01,374 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2020-01-30 07:36:01,418 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2020-01-30 07:36:01,420 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2020-01-30 07:36:01,421 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2020-01-30 07:36:01,422 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2020-01-30 07:36:01,438 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2020-01-30 07:36:01,439 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 273 samples
2020-01-30 07:36:01,439 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2020-01-30 07:36:01,439 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2020-01-30 07:36:01,440 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2020-01-30 07:36:01,441 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2020-01-30 07:36:01,441 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2020-01-30 07:36:01,442 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2020-01-30 07:36:01,445 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2020-01-30 07:36:01,446 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2020-01-30 07:36:01,447 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2020-01-30 07:36:01,448 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2020-01-30 07:36:01,449 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 585 samples
2020-01-30 07:36:01,450 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 117 samples
2020-01-30 07:36:01,450 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 39 samples
2020-01-30 07:36:01,452 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 39 samples produced in 267ms on channel 0
2020-01-30 07:36:01,453 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2020-01-30 07:36:01,458 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2020-01-30 07:36:01,458 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2020-01-30 07:36:01,460 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2020-01-30 07:36:01,461 INFO o.a.j.r.d.JsonExporter: Checking output folder
2020-01-30 07:36:01,464 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to /Users/ktb_user/Documents/loadtest/loadtest/tests/krungthai-next/report/statistics.json
2020-01-30 07:36:01,917 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2020-01-30 07:36:01,928 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /Users/ktb_user/Documents/loadtest/loadtest/tests/krungthai-next/report
2020-01-30 07:36:02,102 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /Users/ktb_user/Documents/loadtest/loadtest/tests/krungthai-next/report, creating folder structure
2020-01-30 07:36:02,119 INFO o.a.j.r.d.TemplateVisitor: Copying folder from '/opt/apache-jmeter-5.1.1/bin/report-template' to '/Users/ktb_user/Documents/loadtest/loadtest/tests/krungthai-next/report', got message:[/Users/ktb_user/Documents/loadtest/loadtest/tests/krungthai-next/report/statistics.json], found non empty folder with following content {}, will be ignored
2020-01-30 07:36:03,214 INFO o.a.j.JMeter: Dashboard generated